Repository: jarkkojs/puavo-os
Catalog: parts/exammode/browser/po/*/puavo-exam-browser.po
Languages: de, fi, sv

source: Joining an exam
de: Einem Prüfung beitreten
fi: Kokeeseen liittyminen
sv: Anslut till web provet

source: Please type a web address of the exam
de: Bitte geben Sie die Webadresse der Prüfung ein
fi: Syötä kenttään kokeen verkko-osoite
sv: Ange provets webbadress

source: Start the exam
de: Prüfung starten
fi: Aloita koe
sv: Starta provet

source: Puavo Exam Browser
fi: Puavo-Koeselain

source: Are you sure you want to close?
de: Sind Sie sicher, dass Sie schließen möchten?
fi: Oletko varma että haluat sulkea selaimen?
sv: Är du säker på att du vill stänga?

source: To exit the exam use the menu on the right of the bottom panel.
de: Um die Prüfung zu verlassen, verwenden Sie das Menü rechts unten.
fi: Poistuaksesi kokeesta käytä alapaneelin menua oikealla.
sv: För att avsluta provet, använd menyn till höger på den nedre panelen.

source: Error in connecting to an exam:
de: Fehler beim Verbinden mit einer Prüfung:
fi: Virhe kokeeseen liityttäessä:
sv: Fel vid anslutning till ett prov:

source: Try again or contact your support services.
de: Versuchen Sie es erneut oder kontaktieren Sie den Support.
fi: Yritä uudelleen tai ole yhteydessä tukipalveluun.
sv: Försök igen eller kontakta supporttjänsten.

source: error in resolving address
de: Fehler bei der Adressauflösung
fi: virhe osoitteenselvityksessä
sv: fel vid adresslösning

source: connection error
de: Verbindungsfehler
fi: yhteysvirhe
sv: anslutningsfel

source: unexpected error
de: unerwarteter Fehler
fi: odottamaton virhe
sv: oväntat fel
