Repository: jarkkojs/puavo-os
Catalog: rules/gnome_shell_extensions/files/printers@linux-man.org/locale/*/LC_MESSAGES/printers.po
Languages: fi

source: Printers
fi: Tulostimet

source: Cancel all jobs
fi: Poista kaikki tulostustyöt

source: at
fi: sijainnissa

source: Send to front
fi: Siirrä tulostustyö listan ensimmäiseksi

source: Interface
fi: Hallintakäyttöliittymä

source: Show icon
fi: Näytä kuvake

source: Always
fi: Aina

source: When printers exist
fi: Kun tulostimia on olemassa

source: When printing
fi: Tulostettaessa

source: Show printer error icon
fi: Näytä tulostuksen virhekuvake

source: Show documents count next to icon
fi: Näytä paneelikuvakkeen vieressä tulostustöiden lukumäärä

source: Show each document number on print list
fi: Näytä tulostustyön numero listanäkymässä

source: Documents can be sent to front
fi: Tulostustyö voidaan siirtää listan ensimmäiseksi
