Repository: jarkkojs/puavo-os
Catalog: parts/veyon-applet/po/*/puavo-veyon-applet.po
Languages: de, fi, sv

source: %s on %s has joined session.
de: %s auf %s hat die Sitzung angemeldet.
fi: %s on liittynyt sessioon tietokoneelta %s.
sv: %s har anslutat sig till sessionen på %s.

source: %s on %s disconnected from session.
de: %s auf %s hat die Sitzung abgemeldet.
fi: %s tietokoneella %s poistui sessiosta.
sv: %s på datorn %s har lämnat sessionen.

source: Participants: %d (see log)
de: Teilnehmer:innen: %d (Protokoll öffnen)
fi: Osallistujia: %d (katso logi)
sv: Deltagare: %d (se logg)

source: Change PIN
de: PIN ändern
fi: Vaihda PIN
sv: Byta PIN

source: Open control panel
de: Veyon Master öffnen
fi: Avaa hallintapaneeli
sv: Öppna kontrollbord

source: Invite to session by group
de: Eine Gruppe zur Veyon-Sitzung einladen
fi: Kutsu sessioon ryhmän mukaan
sv: Bjuda in session enligt gruppen

source: Setup a Veyon session
de: Veyon-Sitzung erstellen
fi: Tee uusi Veyon-sessio
sv: Skapa en ny Veyon-session

source: Close a Veyon session
de: Veyon-Sitzung beenden
fi: Sulje Veyon-sessio
sv: Stänga Veyon-sessionen

source: Choose a group to invite to a session:
de: Lade die folgende Gruppe in diese Sitzung ein:
fi: Valitse ryhmä, jonka haluat kutsua sessioon:
sv: Välj grupp, som du vill bjuda in i sessionen

source: Cancel
de: Abbrechen
fi: Peruuta
sv: Avbryta

source: Inviting "%s" to join a session.
de: "%s" wird zur Veyon-Sitzung eingeladen
fi: Kutsutaan "%s" sessioon.
sv: Bjuder "%s" att ansluta sig till sessionen.

source: Puavo Veyon connection log
de: Puavo Veyon Verbindungsprotokoll
fi: Puavo Veyon -yhteysloki
sv: Puavo Veyon anslutningslogg

source: Disconnected participant
de: Abgemeldete Teilnehmer:in
fi: Osallistuja poistunut
sv: Deltagaren lämnade sessionen

source: Duplicate session error
de: Duplikatsitzungfehler
fi: Kaksoissessio-ongelma
sv: Dubbelsession-problem

source: Closing connections because of a duplicate session, are there many sessions with the same PIN?
fi: Suljetaan yhteydet kaksoissessio-ongelman takia, onko useammassa sessiossa sama PIN-koodi?
sv: Anslutningarna stängs på grund av dubbelsession-problem. Finns det flera sessioner med samma PIN-kod?

source: Join a Veyon session
de: Ein Veyon-Sitzung
fi: Liity Veyon-sessioon
sv: Ansluta Veyon-sessionen

source: Veyon session closed
de: Die Veyon-Sitzung wurde beendet
fi: Veyon-sessio suljettu
sv: Veyon-sessionen stängdes

source: PIN for Veyon session:
de: PIN für die Veyon-Sitzung:
fi: PIN Veyon-sessioon:
sv: PIN för Veyon-sessionen:

source: %s on host %s requests you to join to a Veyon session.
de: %s auf das Gerät %s bittet um diese Sitzung verbinden zu können.
fi: %s tietokoneella %s pyytää sinua liittymään Veyon-sessioon.
sv: %s på datorn %s ber dig att ansluta till Veyon-sessionen.

source: Check PIN.
de: Bitte PIN prüfen.
fi: Tarkista PIN.
sv: Kolla PIN.

source: Check PIN and press ENTER to accept external control.
de: Bitte die PIN kontrollieren und die Eingabetaste drücken, zu externes Steuerung zu zustimmen.
fi: Tarkista PIN ja paina ENTER, jos sallit ulkoisen hallinnan.
sv: Kolla PIN och trycka på ENTER, om du tillåter externt övervakandet.

source: Close a Veyon session that is controlled by %s on %s
de: Verlasse die von %s auf %s gesteuerte Veyon-SItzung.
fi: Sulje Veyon-sessio, jota hallitsee %s koneella %s
sv: Stäng Veyon-Sessionen, som övervakas av %s på datorn %s

source: no matching session found for PIN
de: keine passende Sitzungen für die PIN gefunden
fi: ei löytynyt sessiota antamallasi PIN-koodilla
sv: Ingen session hittades med PIN-Kod som du gav

source: connecting...
de: verbindet...
fi: otetaan yhteyttä...
sv: Anslutar ...

source: timeout
fi: aikakatkaisu

source: connecting to %s (%s)
de: verbindet mit %s (%s)
fi: yhdistetään koneeseen %s (%s)
sv: Anslutar med datorn %s (%s)

source: Veyon session opened
de: Veyon-Sitzung geöffnet
fi: Veyon-sessio avattu
sv: Veyon-sessionen öppnades

source: This computer may now be viewed and controlled by %s from %s.
de: Dieser Computer kann jetzt von %s auf %s beobachtet und gesteuert werden.
fi: Tätä tietokonetta voi nyt katsella ja hallita %s koneelta %s.
sv: Den här datorn kan nu ses och övervakas av %s från %s.

source: Fatal error on Puavo Veyon Applet
de: Ein schwerer Fehler in dem Puavo Veyon Applet
fi: Paha virhe Puavo Veyon -appletissa
sv: Ett alvarligt Fel uppståd på Puavo Veyon applet

source: Unexpected dbus error on Puavo Veyon Applet.
de: Unerwartete DBus-Fehler in Puavo Veyon Applet.
fi: Odottamaton dbus-virhe Puavo Veyon Appletissa.
sv: oväntad dbus-fel på Puavo Veyon -applet.
