Repository: jarkkojs/puavo-os
Catalog: parts/user-registration/po/*/puavo-user-registration.po
Languages: fi, sv

source: Go to desktop?
fi: Siirry työpöydälle?
sv: Gå till skrivbordet?

source: Are you sure you do not want to create a user account? Without a user account, your files will be lost after your desktop session ends.
fi: Oletko varma, että et halua luoda käyttäjätunnusta? Ilman käyttäjätunnusta tiedostosi katoavat, kun työpöytäsessiosi loppuu.
sv: Är du säker att du inte vill skapa ett användarnamn? Utan ett användarkonto, ska dina filer bortkastas när du stänger datorn.

source: internal error: username and password missing
fi: sisäinen virhe: käyttäjänimi ja salasana puuttuvat
sv: internt fel: användarnamn och lösenord fattas

source: Could not do initial login with new user credentials. Please remember your username "%s" and password for the first login. Contact support if there are problems.
fi: Ensikirjautuminen uudella tunnuksella ei onnistunut. Muista käyttäjätunnuksesi "%s" ja salasanasi ensikirjautumista varten. Ota ongelmatilanteissa yhteys tukeen.
sv: Kunde inte ĺogga in med det nya användarnamnet. Kom ihåg ditt användarnamn "%s" och lösenord för första inloggning. Kontakta stödtjänst om det finns ett problem.

source: Error
fi: Virhe
sv: Fel

source: Could not disable the registration tool. Please contact support.
fi: Rekisteröintityökalun poiskytkentä ei onnistunut. Ota yhteys tukeen.
sv: Kunde inte inaktivera registreringsverktyg. Vänligen kontakta stödtjänsten.

source: Reboot
fi: Uudelleenkäynnistys
sv: Starta om datorn

source: Could not reboot.
fi: Uudelleenkäynnistys ei onnistunut.
sv: Kunde inte starta om datorn.

source: Bad username and/or password
fi: Väärä käyttäjätunnus ja/tai salasana
sv: Felaktig användarnamn och/eller lösenord

source: An unexpected error occurred
fi: Tapahtui odottamaton virhe
sv: Ett oväntad fel uppstod

source: You do not have the required permissions to use this tool.
fi: Sinulla ei ole tarvittavia oikeuksia tämän työkalun käyttöön.
sv: Du har inte behörigheter att använda det här verktyget.

source: No permissions
fi: Ei oikeuksia
sv: Inga behörigheter

source: Finnish
fi: Suomi
sv: Finska

source: Swedish
fi: Ruotsi
sv: Svenska

source: English
fi: Englanti
sv: Engelska

source: German
fi: Saksa
sv: Tyska

source: first name
fi: etunimi
sv: förnamn

source: last name
fi: sukunimi
sv: efternamn

source: login name
fi: käyttäjätunnus
sv: användarnamn

source: email address
fi: sähköpostiosoite
sv: e-postadress

source: phone number
fi: puhelinnumero
sv: telefonnummer

source: is empty
fi: on tyhjä
sv: är tom

source: contains bad characters
fi: sisältää virheellisiä merkkejä
sv: innehåller ogiltiga tecken

source: is too long
fi: on liian pitkä
sv: är för lång

source: Account Setup
fi: Rekisteröinti
sv: Kontoinställningar

source: The login name contains invalid characters
fi: Käyttäjätunnus sisältää virheellisiä merkkejä
sv: Användarnamnet innehåller ogiltiga tecken

source: The login name must be at least three characters long
fi: Käyttäjätunnuksen on oltava vähintään kolme merkkiä pitkä
sv: Användarnamnet måste vara minst tre tecken lång

source: The login name must start with a letter
fi: Käyttäjätunnuksen täytyy alkaa kirjaimella
sv: Användarnamnet måste börja med en bokstav

source: Sending information to the server...
fi: Lähetetään tietoja palvelimelle...
sv: Informationen skickas till servern

source: Something went wrong on the server end.
fi: Jokin meni pieleen palvelinpäässä
sv: Någonting gick fel på serversidan

source: Please contact support and give them this code:
fi: Ole hyvä ja ota yhteys tukeen, anna tämä koodi:
sv: Kontakta stödtjänsten och ge dem den här koden:

source: Something is wrong on the following form fields. Check their contents and try again.
fi: Näiden kenttien sisällössä on jotain vikaa. Tarkista niiden sisältö ja yritä uudelleen.
sv: Det finns fel på följande fält. Kontrollera dem och försök igen.

source: Bad Information
fi: Epäkelpoa tietoa
sv: Felaktig information

source: This registration program sent bad information to the server.
fi: Tämä rekisteröintiohjelma lähetti epäkelpoa tietoa palvelimelle.
sv: Det här registreringsprogramm skickade felaktig information till servern.

source: Invalid organisation
fi: Virheellinen organisaatio
sv: Ogiltig organisation

source: This machine has been registered to an invalid organisation.
fi: Tämä laite on rekisteröity virheelliseen organisaatioon.
sv: Den här datorn har registrerats till en fel organisation.

source: Missing information
fi: Puutteelliset tiedot
sv: Informationen saknas

source: Registration program did not send all required information to server.
fi: Rekisteröintiohjelma lähetti palvelimelle puutteellisia tietoja.
sv: Registreringsprogrammet skickade inte all data som krävs till servern.

source: Invalid input
fi: Virheellinen tieto
sv: Felaktig input

source: The login name contains invalid characters.
fi: Käyttäjätunnus sisältää virheellisiä merkkejä.
sv: Användarnamnet innehåller ogiltiga tecken.

source: The email address is not valid.
fi: Sähköpostiosoite ei ole kelvollinen.
sv: Det här e-postaddressen är ogiltig.

source: The password and its confirmation do not match.
fi: Salasana ja sen varmistus eivät täsmää.
sv: Lösenordet och bekräftelsen matchar inte.

source: The selected language is not valid.
fi: Valittu kieli on virheellinen.
sv: Valt språk är ogiltig.

source: An unknown error occurred when handling user information.
fi: Käyttäjätietojen käsittelyssä tapahtui tuntematon virhe.
sv: Ett okänt fel uppstod när användarinformationen hanterades.

source: Unregistered host
fi: Rekisteröimätön kone
sv: Oregistrerad dator

source: This host was not found on the database.
fi: Koneesi tietoja ei löydy tietokannasta.
sv: Datorn hittades inte i databasen.

source: Host is already in use
fi: Kone on jo käytössä.
sv: Datorn har redan tagits i bruk

source: User registration has already been done on this host.
fi: Tältä koneelta on jo suoritettu käyttäjän luonti.
sv: Användarregistrationen har redan gjorts på den här datorn.

source: An unknown error occurred when handling host information.
fi: Laitetietojen käsittelyssä tapahtui tuntematon virhe.
sv: Ett okänt fel uppstod när datorinformationen hanterades.

source: Login name already in use
fi: Käyttäjätunnus on jo käytössä
sv: Användarnamnet är redan i bruk

source: The login name you have chosen is already in use. Please choose another.
fi: Valitsemasi käyttäjätunnus on jo käytössä. Valitse toinen käyttäjätunnus.
sv: Användarnamnet som du har valt är redan i bruk. Välj ett nytt.

source: Too short login name
fi: Liian lyhyt käyttäjänimi
sv: Användarnamnet är för kort

source: Your login name is too short. It must have at least three characters.
fi: Käyttäjänimesi on liian lyhyt. Sen on oltava vähintään kolme merkkiä pitkä.
sv: Ditt användarnamn är för kort. Det måste bestå av minst tre tecken.

source: Email address is already in use
fi: Sähköpostiosoite on jo käytössä
sv: E-postadressen är redan i bruk

source: This email address is already in use. Please use another address.
fi: Tämä sähköpostiosoite on jo käytössä. Käytä toista osoitetta.
sv: Det här e-postadressen är redan i bruk. Använd en annan adress.

source: If using another email address is not possible, please contact support and give them this code:
fi: Jos toisen osoitteen käyttö ei ole mahdollista, ota yhteys tukeen. Anna heille tämä koodi:
sv: Om det är inte möjligt att använda en annan e-postadress, vänligen ta kontakt med kundtjänsten och ge dem den här koden:

source: Could not contact the server:
fi: Ei yhteyttä palvelimeen:
sv: Kunde inte hitta servern:

source: Check the network connection and try again.
fi: Tarkista verkkoyhteyden tila ja yritä uudelleen.
sv: Kontrollera nätverksanslutningen och försök igen.

source: If the problem persists, contact support.
fi: Jos ongelma toistuu, ota yhteys tukeen.
sv: Om problemet består kontakta stödtjänsten

source: The server is not responding. Try again after a while. If the problem persists, contact support.
fi: Palvelin ei vastaa pyyntöön. Yritä lähetystä uudelleen hetken kuluttua. Jos tilanne toistuu, ota yhteys tukeen.
sv: Servern svarar inte. Försök om igen om en stund. Om problemet består kontakta stödtjänsten.

source: Could not interpret the response sent by the server.
fi: Palvelimen palauttamaa viestiä ei pystytty tulkitsemaan.
sv: Kunde inte tolka svaret från servern.

source: Please contact support.
fi: Ole hyvä ja ota yhteys tukeen.
sv: Vänligen kontakta stödtjänsten.

source: Something went wrong
fi: Jokin meni pieleen
sv: Någonting gick fel

source: This situation should never happen, something has gone very badly wrong.
fi: Tätä ei pitäisi koskaan tapahtua, jokin on pahasti pielessä.
sv: Det här situationen borde inte hända, någonting har gått riktigt fel.

source: Congratulations!
fi: Onneksi olkoon!
sv: Grattis!

source: Your user account has been created.
fi: Tunnuksesi on luotu.
sv: Ditt användarkonto har skapats.

source: Login with your user account was successful.
fi: Kirjautuminen käyttäjätunnuksellasi onnistui.
sv: Loggning med ditt användarkonto var framgångsrik.

source: Have a nice time with your studies!
fi: Mukavaa opiskeluaikaa!
sv: Ha det bra med dina studier!

source: System must be rebooted.
fi: Tietokoneesi täytyy käynnistää uudelleen.
sv: Systemet måste startas om.

source: Network Setup
fi: Verkkoasetukset
sv: Nätverksinställningar

source: Searching for networks...
fi: Etsitään verkkoja...
sv: Söker efter nätverk....

source: Connecting to "%s"...
fi: Yhdistetään verkkoon "%s"...
sv: ansluter till "%s"...

source: Connection successful!
fi: Yhdistetty!
sv: Anslutningen lyckades!

source: Connection failed
fi: Yhteyden muodostus epäonnistui
sv: Anslutningen mislyckades

source: Connect to network
fi: Yhdistä verkkoon
sv: Ansluta till ett nätverk

source: Use network "%s"?
fi: Käytä verkkoa "%s"?
sv: Använda nätverket "%s"?

source: You are connected to network "%s", do you want to use this network?
fi: Olet liittyneenä verkkoon "%s", haluatko käyttää tätä verkkoa?
sv: Du är anslutat till nätverket "%s", vill du använda det?

source: Join wireless network?
fi: Liity langattomaan verkkoon?
sv: Ansluta till ett trådlöst nätverk?

source: You are connected to a network that is not a wireless network. Do you want to join a wireless network anyway?
fi: Olet liittyneenä verkkoon joka ei ole langaton verkko. Haluatko silti liittyä langattomaan verkkoon?
sv: Du är anslutat med ett nätverk som inte är trådlöst. Vill du fortsätta ändå?

source: Welcome!
fi: Tervetuloa!
sv: Välkommen!

source: To put your new laptop into use, we guide you to:
fi: Uuden kannettavasi käyttöönottamiseksi, sinut opastetaan seuraavaksi:
sv: För att ta din nya bärbar dator till bruk, guidar vi dig till:

source: Join a wireless network
fi: Liittymään langattomaan verkkoon
sv: Ansluta till trådlöst nätverk

source: Login or register your new login
fi: Kirjautumaan tai rekisteröimään itsellesi uusi käyttäjätunnus
sv: Logga in eller registrera ett användarnamn

source: Tip:
fi: Vinkki:
sv: Tips:

source: In case you can not connect to a wireless network right now, you can do that later and use this host temporarily in guest-mode by clicking the
fi: Siinä tapauksessa, että et voi liittää konettasi langattomaan verkkoon juuri nyt, voit tehdä sen myöhemmin ja käyttää tätä konetta tilapäisesti vieras-tilassa klikkaamalla
sv: I fallet du inte kan kontakta till ett trådlöst nätverk nu, kan du göra det senare och använda temporärt gästläge genom att klicka

source: Go to desktop
fi: Siirry työpöydälle
sv: Gå till skrivbordet

source: button in the bottom corner.
fi: painiketta alareunassa.
sv: knappen i det nedre hörnet.

source: First name:
fi: Etunimi:
sv: Förnamn:

source: Last name:
fi: Sukunimi:
sv: Efternamn:

source: Login name:
fi: Käyttäjätunnus:
sv: Användarnamnet:

source: Email address:
fi: Sähköpostiosoite:
sv: E-postadress:

source: Login password:
fi: Salasana:
sv: Lösenordet:

source: Password confirmation:
fi: Salasanan vahvistus:
sv: Bekräfta lösenordet:

source: Language:
fi: Kieli:
sv: Språk:

source: Phone number:
fi: Puhelinnumero:
sv: Telefonnummer:

source: The phone number is optional. It is used only for technical support. Please enter only digits, + and - -signs.
fi: Puhelinnumero on valinnainen. Sitä käytetään vain tukitilanteissa. Käytäthän vain numeroita, + ja - -merkkejä.
sv: Telefonnummern är frivillig. Det används bara för teknisk stöd. Ange bara siffror, + och - -tecken

source: You will receive a confirmation to your email. The address is also used for password resets.
fi: Saat sähköpostiisi vahvistuksen rekisteröinnistä. Osoitetta käytetään myös salasanan nollauksiin.
sv: Du ska få bekräftelsen till ditt e-post. Adressen används också för att återställa lösenord.

source: Previous
fi: Edellinen
sv: Föregående

source: Create your account!
fi: Luo tunnus!
sv: Skapa ditt konto!

source: Finish and reboot
fi: Lopeta ja uudelleenkäynnistä
sv: Slutför och starta om

source: Login
fi: Kirjaudu
sv: Logga in

source: No user account? Create one!
fi: Ei käyttäjätunnusta? Luo uusi!
sv: Inget användarkonto? Skapa ett nytt!

source: New User Registration
fi: Uuden käyttäjän rekisteröinti
sv: Användarregistrering

source: Privacy policy
fi: Rekisteriseloste
sv: Integritetspolicy

source: Username:
fi: Käyttäjätunnus:
sv: Användarnamn:

source: Password:
fi: Salasana:
sv: Lösenord:

source: Connect
fi: Yhdistä
sv: Ansluta

source: Next
fi: Seuraava
sv: Nästa
